#!/bin/bash
# create 2025/.08.29
# author k-mitarai

# -----------------------------------------------------------
# gmshを利用したメッシュファイル作成
# -clamx後の数値(例示は1)で最大メッシュサイズ指定、小さくすれば細かくなる
# -----------------------------------------------------------
gmsh -3 test_3dcad.STEP -clmax 1 -o tmp_mesh.unv | tee log_gmsh.txt


# -----------------------------------------------------------
# ElmerGridでElmerSolverが読み出せる形に変更
# -----------------------------------------------------------
ElmerGrid 8 2 tmp_mesh.unv -out ./ | tee log_elmergrid.txt


# -----------------------------------------------------------
# case.sifを指定してElmerSolver実行
# case.sifは少数繰り返しでもよいので先んじて実行できるものを作成しておくこと
# -----------------------------------------------------------
ElmerSolver case.sif | tee log_elmersolver.txt
